#include <stdio.h>

float multiply_test() {
    float a[6][6] = {{1.1, 1.2, 2.3, 2.4, 2.5, 2.6}, {5.5, 6.4, 3.3, 6.1, 6.2, 6.4}, {1.7, 1.5, 5.9, 0.4, 1.5, 4.8}, {1.1, 1.2, 2.3, 2.4, 2.5, 2.6}, {5.5, 6.4, 3.3, 6.1, 6.2, 6.4}, {1.7, 1.5, 5.9, 0.4, 1.5, 4.8}};;
    float b[6][6] = {{1.1, 1.2, 2.3, 2.4, 2.5, 2.6}, {5.5, 6.4, 3.3, 6.1, 6.2, 6.4}, {1.7, 1.5, 5.9, 0.4, 1.5, 4.8}, {1.1, 1.2, 2.3, 2.4, 2.5, 2.6}, {5.5, 6.4, 3.3, 6.1, 6.2, 6.4}, {1.7, 1.5, 5.9, 0.4, 1.5, 4.8}};;
    float c[6][6] = {0};
    int i, j, k;

    for (i = 0; i < 6; i++) {
        for (j = 0; j < 6; j++) {
            for (k = 0; k < 6; k++) {
                c[i][j] += a[i][j] * b[i][j];
            }
        }
    }
    int d = 6;
    return c[d - 1][5];
}

extern float multiply();

int main() {
    printf("Результат: %.2f\n", multiply_test());
    printf("Результат сгенерированной программы: %.2f\n", multiply());
    return 0;
}